## Atividade 2 - Algoritmos básicos de programação em linguagem python e visualização e análise de dados.

<hr>

#### Questão 1 - Escreva uma função que receba uma lista de números e retorne outra lista com os números ímpares.

In [6]:
def num_impares(numeros):
    impares = []
    for num in numeros:
        if (num % 2) != 0:
            impares.append(num)            
    return impares

numeros = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
print(num_impares(numeros))

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

<hr>

#### Questão 2 -  Escreva uma função que receba uma lista de números e retorne outra lista com os números primos presentes.

In [7]:
def verificando_primo(number):
    if number < 2: 
        return False
    for i in range(2, int(number ** 0.5) + 1):
        if number % i == 0:
            return False
    return True

def num_primos(numeros):
    primos = []
    for num in numeros:
        if verificando_primo(num):
            primos.append(num)
    return primos    

numeros = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
print(num_primos(numeros))

[2, 3, 5, 7, 11, 13, 17, 19]

<hr>

#### Questão 3 -  Escreva uma função que receba duas listas e retorne outra lista com os elementos que estão presentes em apenas uma das listas.

In [11]:
# Utilizei o módulo random para escolher de forma aleatória uma das duas listas 
import random

def nova_lista(numeros1, numeros2):
    opcao = [numeros1, numeros2]
    numeros3 = []
    for num in random.choice(opcao):
        numeros3.append(num)
    print(numeros3)    

numeros1 = [1, 3, 5, 7, 9]
numeros2 = [2, 4, 6, 8, 10]

nova_lista(numeros1, numeros2)

[2, 4, 6, 8, 10]

<hr>

#### Questão 4 - Dada uma lista de números inteiros, escreva uma função para encontrar o segundo maior valor na lista.

In [15]:
def segundo_maior(numeros):
    primeiro_maior = 0
    segundo_maior = 0

    for num in numeros:
        if num > primeiro_maior:
            segundo_maior = primeiro_maior
            primeiro_maior = num
        elif primeiro_maior > num > segundo_maior:
            segundo_maior = num
    return segundo_maior

numeros = [10, 5, 20, 8, 20, 12, 40]
print(segundo_maior(numeros))

20

<hr>

#### Questão 5 - Crie uma função que receba uma lista de tuplas, cada uma contendo o nome e a idade de uma pessoa, e retorne a lista ordenada pelo nome das pessoas em ordem alfabética

In [35]:
def ordenar_1(pessoas):
    return sorted(pessoas, key=lambda pessoa: pessoa[0])

lista_pessoas = [("João", 30), ("Ana", 25), ("Carlos", 22), ("Bruna", 27), ("Fernando", 30), ("Bruno", 28)]
print(ordenar_1(lista_pessoas))

[('Ana', 25), ('Bruna', 27), ('Bruno', 28), ('Carlos', 22), ('Fernando', 30), ('João', 30)]

In [37]:
# Caso a tupla esteja na ordem ("Nome", idade), o codigo anterior funciona.
# Porém o problema não deu essa informação, tornando necessário verificar qual dos dois elementos contém a string com o nome.

def obter_nome(tupla):
    if isinstance(tupla[0], str):
        return tupla[0]
    elif isinstance(tupla[1], str):
        return tupla[1]
    else:
        return ""
    
def ordenar_2(lista_pessoas):
    return sorted(lista_pessoas, key=obter_nome)

lista_pessoas = [(30, "João"), (25, "Ana"), ("Carlos", 22), (27, "Bruna"), ("Fernando", 30), ("Bruno", 28)]
lista_ordenada = ordenar_2(lista_pessoas)
print(lista_ordenada)

[(25, 'Ana'), (27, 'Bruna'), ('Bruno', 28), ('Carlos', 22), ('Fernando', 30), (30, 'João')]

<hr>

#### Questão 6 - Observe os espaços sublinhados e complete o código.

```python
 import __________.pyplot as plt
 import numpy as ___

 fig, axs = plt.subplots(ncols=2, nrows=2, figsize=(5.5, 3.5), layout="constrained")
 for ___ in range(2):
    for ___ in range(2):
        axs[row, col].annotate(f'axs[{row}, {col}]', (0.5, 0.5), 
                        transform=axs[row, col].transAxes,
                        ha='center', va='center', ________=18,
                        color='darkgrey')
 fig.suptitle('__.subplots()')
```

##### RESPOSTA
```python
 import matplotlib.pyplot as plt
 import numpy as np

 fig, axs = plt.subplots(ncols=2, nrows=2, figsize=(5.5, 3.5), layout="constrained")
 for row in range(2):
    for col in range(2):
        axs[row, col].annotate(f'axs[{row}, {col}]', (0.5, 0.5), 
                        transform=axs[row, col].transAxes,
                        ha='center', va='center', fontsize=18,
                        color='darkgrey')
 fig.suptitle('plt.subplots()')
```

<hr>

#### Questão 7 - Observe os espaços sublinhados e complete o código.

```python
 import numpy as np
 import __________ as mpl
 import __________.______ as plt
 x = np.________(-2 * np.pi, 2 * np.pi, 100)
 y = np.____(x)
 __, __ = plt.subplots()
 ax.____(_, _)
```

##### RESPOSTA
```python
 import numpy as np
 import matplotlib as mpl
 import matplotlib.pyplot as plt
 x = np.linspace(-2 * np.pi, 2 * np.pi, 100)
 y = np.sin(x)
 fig, ax = plt.subplots()
 ax.plot(x, y)
```

<hr>

#### Questão 8 - Utilizando pandas, como realizar a leitura de um arquivo CSV em um DataFrame e exibir as primeiras linhas?

##### Passo a passo:
1. Importar a biblioteca
    ```python
    import pandas as pd
    ```
2. Carregar o arquivo CSV
    ```python
    df = pd.read_csv('arquivo')
    ```
3. Exibir as primeiras linhas
    ```python
    df.head()
    ```
        É possível passar um parâmetro no método head() indicando quantas linhas deseja exibir, o padrão são 5 linhas.

In [46]:
# Importando biblioteca
import pandas as pd

# Carregando o arquivo
df_titanic = pd.read_csv("titanic.csv")

# Exibindo as primeiras linhas
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<hr>

#### Questão 9 - Utilizando pandas, como selecionar uma coluna específica e filtrar linhas em um “DataFrame” com base em uma condição?

##### Passo a passo:
1. Selecionar uma coluna específica
    ```python
    df['coluna']
    ```
2. Aplicar filtro
    ```python
    df[df['coluna'] > n]
    df[df['coluna'] < n]
    ```

In [53]:
# Selecionando a coluna 'Sex'
coluna_sex = df_titanic['Sex']
print(coluna_sex)

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [51]:
# Filtrando por sexo masculino
df_filtrado = df_titanic[df_titanic['Sex'] == 'male']
df_filtrado

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<hr>

#### Questão 10 - Utilizando pandas, como lidar com valores ausentes (NaN) em um DataFrame?

##### Passo a passo:
1. Verificar se há valores ausentes
    ```python
    df.isna() 
    df.isna().sum()
    ```

2. Aplicar a estratégia escolhida, podendo ser:
    - Preencher os valores ausentes por um valor específico
        ```python
        df['coluna'].fillna(valor, inplace=True) 
        ```
    - Remover linhas com valores ausentes
        ```python
        df.dropna(inplace=True)
        ```

In [55]:
# Verificando a quantidade de valores ausentes em cada coluna no DataFrame
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [56]:
# Ausentes na coluna 'Embarked'
df_titanic[df_titanic['Embarked'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [57]:
# Substituindo dados ausentes pelo valor 'S' que indica o porto Southampton
df_titanic['Embarked'].fillna('S', inplace=True)
df_titanic[df_titanic['Embarked'].isna()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [58]:
# Ausentes na coluna 'Age'
df_titanic[df_titanic['Age'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [59]:
# Detalhando a tabela 'Age'
df_titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [61]:
# Calculando a mediana das idades
mediana_idade = df_titanic['Age'].median()
mediana_idade

28.0

In [63]:
# Substituindo dados ausentes pela mediana das idades
df_titanic['Age'].fillna(mediana_idade, inplace=True)
df_titanic[df_titanic['Age'].isna()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [64]:
# Deletando a coluna 'Cabin'
df_titanic = df_titanic.drop('Cabin',axis=1)

In [65]:
# Verificando a quantidade de valores ausentes em cada coluna
df_titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64